export default [
  {gn: '二同号', id: '5009:1', n: '二同复选', d: '对三个号码中两个指定的相同号码进行投注。(选择范围11-66)', e: '投注方案：66； 开奖号码出现：2个6，即中二同复选。'},
  {gn: '二同号', id: '5010:1', n: '二同单选', d: '对三个号码中两个指定的相同号码和一个指定的不同号码进行投注。（分别选择同号和不同号）', e: '投注方案：同号11、不同号2； 开奖号码为112（顺序不限），即中二同单选。'},
  {gn: '二不同号', id: '5012:1', n: '二不同标准', d: '对三个号码中两个指定的不同号码进行投注。', e: '投注方案：12； 开奖号码出现: 1个1，1个2(顺序不限)，即中二不同标准。'},
  {gn: '二不同号', id: '5014:1', n: '二不同胆拖', d: '从1-6中，选取2个及以上的号码进行投注，每注需至少包括1个胆码及1个拖码。', e: '投注方案：12； 开奖号码: 123，即中二不同胆拖。'},
  {gn: '三同号', id: '5003:1', n: '三同单选', d: '从所有相同的三个号码（111、222、…、666）中任意选择一组号码进行投注', e: '投注方案：111； 开奖号码: 111，即中三同单选。'},
  {gn: '三同号', id: '5002:1', n: '三同通选', d: '对所有相同的三个号码（111、222、…、666）进行投注。', e: '投注方案：全； 开奖号码: 111,222,333,444,555,666，即中三同通选。'},
  {gn: '三不同号', id: '5004:1', n: '三不同标准', d: '从1-6中任选3个或者3个以上的号码，所选号码与开奖号码相同即中奖。', e: '投注方案：123； 开奖号码: 123(顺序不限)，即三中不同标准。'},
  {gn: '三不同号', id: '5006:1', n: '三不同胆拖', d: '从1-6中，选取胆码最多为2个号码，且与拖码组成个数大于或者等于3的投注号码进行投注，选择的胆码必须全部与开奖号码相符才算中奖。', e: '投注方案：2,45或24,5或4,265； 开奖号码: 245(顺序不限)，即中三不同胆拖。'},
  {gn: '三连号', id: '5016:1', n: '三连单选', d: '对三连号选择一个或多个投注', e: '投注方案：123； 开奖号码: 123(顺序不限)，即中三连单选。'},
  {gn: '三连号', id: '5008:1', n: '三连通选', d: '对所有三个相连的号码（仅限：123、234、345、456）进行投注。', e: '投注方案：全； 开奖号码: 123, 234, 345, 456(顺序不限)，即中三连通选。'},
  {gn: '趣味', id: '5001:1', n: '和值', d: '从3-18中任意选择1个或1个以上号码，所选号码与开奖号和值相同即中奖. ', e: '投注方案：6； 开奖号码: 231(加起来等于6)，即中和值。'},
  {gn: '趣味', id: '5015:1', n: '猜1个号就中奖', d: '选择1个您认为一定会开出的号码，系统将智能为您筛选出包含该号码的单选号码组合。', e: '投注方案：6； 开奖号码出现：1个6，即中猜1个号就中奖'},
]
