export default [
  {gn: '任选', id: '3001:1', n: '任选一', d: '从01-80中任选1个及以上号码。', e: '投注方案：01； 开奖号码：01 * * * * * * * * * *，即中任选一。'},
  {gn: '任选', id: '3002:1', n: '任选二', d: '从01-80中任选2个及以上号码。', e: '投注方案：01 02； 开奖号码：01 02 * * * * * * * * *，即中任选二。'},
  {gn: '任选', id: '3003:1', n: '任选三', d: '从01-80中任选3个及以上号码。', e: '投注方案：01 02 03； 开奖号码：01 02 03 * * * * * * * *，即中任选三。'},
  {gn: '任选', id: '3004:1', n: '任选四', d: '从01-80中任选4个及以上号码。', e: '投注方案：01 02 03 04； 开奖号码：01 02 03 04 * * * * * * *，即中任选四。'},
  {gn: '任选', id: '3005:1', n: '任选五', d: '从01-80中任选5个及以上号码。', e: '投注方案：01 02 03 04 05； 开奖号码：01 02 03 04 05 * * * * * *，即中任选五。'},
  {gn: '任选', id: '3006:1', n: '任选六', d: '从01-80中任选6个及以上号码。', e: '投注方案：01 02 03 04 05 06； 开奖号码：01 02 03 04 05 06 * * * * *，即中任选六。'},
  {gn: '任选', id: '3007:1', n: '任选七', d: '从01-80中任选7个及以上号码。', e: '投注方案：01 02 03 04 05 06 07； 开奖号码：01 02 03 04 05 06 07 * * * *，即中任选七。'},
  {gn: '趣味', id: '3008:1', n: '上下盘', d: '20个开奖号码中“上盘(01-40)”与“下盘(41-80)”号码个数相比，上盘个数大于下盘个数，则为上盘，否则为下盘， 个数相等则为和盘', e: '投注方案：上盘；开奖号码中01-40占比超过10个，即中上下盘'},
  {gn: '趣味', id: '3009:1', n: '奇偶盘', d: '0个开奖号码中“奇盘(奇数)”与“偶盘(偶数)”号码个数相比，奇盘个数大于偶盘个数，则为奇盘，否则为偶盘， 个数相等则为和盘', e: '投注方案：奇盘；开奖号码中奇数占比超过10个，即中奇偶盘'},
  {gn: '趣味', id: '3010:1', n: '和值大小单双', d: '20个开奖号码总和值的“大(>810)小(<810)单双”属性组合。', e: '投注方案：大；20个开奖号码之和大于810，即中和值大小单双'},
  {gn: '趣味', id: '3011:1', n: '五行', d: '开奖20个号码的总和分在5个波段中，5个波段以金、木、水、火、土命名：金（210～695）、木（696～763）、水（764～855）、火（856～923）和土（924～1410）', e: '投注方案：金；总和是693，即中五行'},
]