export default [
  {gn: '趣味', id: '8001:1', n: '和值', d: 'PC蛋蛋开奖结果来源于国家福利彩票北京快乐8开奖号码。\n北京快乐8每期开奖共开出20个数字，PC蛋蛋将这20个开奖号码按照由小到大的顺序依次排列；取其1-6位开奖号码相加，和值的末位数作为PC蛋蛋开奖第一个数值； 取其7-12位开奖号码相加，和值的末位数作为PC蛋蛋开奖第二个数值，取其13-18位开奖号码相加，和值的末位数作为PC蛋蛋开奖第三个数值；三个数值相加即为PC蛋蛋最终的开奖结果。', e: ''},
  {gn: '趣味', id: '8002:1', n: '极值', d: '开奖号码和值在0-5内为极小，和值范围在22-27为极大。', e: ''},
  {gn: '趣味', id: '8003:1', n: '大小单双', d: '开奖号码和值在0-13为小，14-27为大，单数为单，双数为双。', e: ''},
  {gn: '趣味', id: '8004:1', n: '大小单双组合', d: '开奖号码和值在0-13内且为双数为小双，反之为小单；开奖号码和值在14-27内且为双数为大双，反之为大单。', e: ''},
]