export default [
  {gn: '猜冠亚军', id: '4001:1', n: '猜冠军', d: '从01-10中共10个号码中选择1个号码，每注由1个号码组成，只要当期冠军号码为所选号码，即为中奖。', e: '投注方案：01； 开奖号码：01 * * * * * * * * * *，即中猜冠军。'},
  {gn: '猜冠亚军', id: '4002:1', n: '猜冠亚军', d: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军。'},
  {gn: '猜冠亚军', id: '4013:0', n: '猜冠亚军单式', d: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', e: '投注方案：0102； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军单式。'},
  {gn: '猜三四名', id: '4003:1', n: '猜前三名', d: '从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜前三名。'},
  {gn: '猜三四名', id: '4016:0', n: '猜前三名单式', d: '从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜前三名单式。'},
  {gn: '猜三四名', id: '4004:1', n: '猜前四名', d: '从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名。'},
  {gn: '猜三四名', id: '4017:0', n: '猜前四名单式', d: '从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名单式。'},
  {gn: '猜三四名', id: '4015:1', n: '猜三四名复式', d: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个,第4个号码相同，且顺序一致，即为中奖。', e: '投注方案：0102； 开奖号码：* * 01 02 * * * * * * *，即中猜冠亚军单式。'},
  {gn: '猜三四名', id: '4014:0', n: '猜三四名单式', d: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个,第4个号码相同，且顺序一致，即为中奖。', e: '投注方案：0102； 开奖号码：* * 01 02 * * * * * * *，即中猜冠亚军单式。'},
  {gn: '趣味', id: '4011:1', n: '龙虎', d: '第一名和最后一名比较，第一名大是龙，最后一名大是虎', e: '投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。'},
  {gn: '趣味', id: '4012:1', n: '定位胆', d: '', e: ''},
]