export default [
  {gn: '猜冠亚军', id: '4001:1', n: '猜冠军', d: '从01-10中共10个号码中选择1个号码，每注由1个号码组成，只要当期冠军号码为所选号码，即为中奖。', e: '投注方案：01； 开奖号码：01 * * * * * * * * * *，即中猜冠军。'},
  {gn: '猜冠亚军', id: '4002:1', n: '猜冠亚军', d: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军。'},
  {gn: '猜冠亚军', id: '4013:0', n: '猜冠亚军单式', d: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前2个号码相同，且顺序一致，即为中奖。', e: '投注方案：0102； 开奖号码：01 02 * * * * * * * * *，即中猜冠亚军单式。'},
  {gn: '猜三四名', id: '4003:1', n: '猜前三名', d: '从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜前三名。'},
  {gn: '猜三四名', id: '4016:0', n: '猜前三名单式', d: '从01-10共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02,03； 开奖号码：01 02 03 * * * * * * * *，即中猜前三名单式。'},
  {gn: '猜三四名', id: '4004:1', n: '猜前四名', d: '从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名。'},
  {gn: '猜三四名', id: '4017:0', n: '猜前四名单式', d: '从01-10共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，且顺序一致，即为中奖。', e: '投注方案：01,02,03,04； 开奖号码：01 02 03 04 * * * * * * *，即中猜前四名单式。'},
  {gn: '猜三四名', id: '4015:1', n: '猜三四名复式', d: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个,第4个号码相同，且顺序一致，即为中奖。', e: '投注方案：0102； 开奖号码：* * 01 02 * * * * * * *，即中猜冠亚军单式。'},
  {gn: '猜三四名', id: '4014:0', n: '猜三四名单式', d: ' 从01-10共10个号码中选择2个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的第3个,第4个号码相同，且顺序一致，即为中奖。', e: '投注方案：0102； 开奖号码：* * 01 02 * * * * * * *，即中猜冠亚军单式。'},
  {gn: '趣味', id: '4011:1', n: '龙虎', d: '根据选择的位置比较第一位与第二位号码的大小，大则为：龙，小则为：虎；', e: '选择位置: 一VS十；投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。'},
  {gn: '趣味', id: '4012:1', n: '定位胆', d: '从第一名到第十名、01-10共10个号码中，选择其中一名次中的任意1个号码当作一注，所选名次的号码与当期顺序摇出的10个号码中对应名次的号码一致，即为中奖', e: '投注方案：第一名01，开奖号码： 01 * * * * * * * * *，即中定位胆'},
  // ==============================================================================================================================================================
  // 二星
  {gn: '二星', ln: '前二', id: '4102:1', n: '直选复式', d: '从冠军、亚军中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案：05 08；开奖号码前二位：05 08，即中前二直选复式。'},
  {gn: '二星', ln: '前二', id: '4103:0', n: '直选单式', d: '手动输入2个2位数号码组成一注，所输入的号码与开奖号码冠军、亚军相同，且顺序一致，即为中奖。', e: '投注方案：05 08； 开奖号码：05 08，即中前二直选单式。'},
  {gn: '二星', ln: '前二', id: '4104:1', n: '组选复式', d: '从冠军、亚军中各选择一个号码组成一注，所选号码与开奖号码冠军、亚军相同，顺序不限，即为中奖。', e: '投注方案：05 08； 开奖号码：05 08或者08 05，即中前二组选复式。'},
  {gn: '二星', ln: '前二', id: '4105:0', n: '组选单式', d: '手动输入2个2位数号码组成一注，所输入的号码与开奖号码冠军、亚军相同，顺序不限，即为中奖。', e: '投注方案：05 08； 开奖号码：5 08或者08 05，即中前二组选单式。'},

  {gn: '二星', ln: '后二', id: '4106:1', n: '直选复式', d: '从第九名、第十名中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案： 05 08；开奖号码后二位： 05 08，即中后二直选复式。'},
  {gn: '二星', ln: '后二', id: '4107:0', n: '直选单式', d: '手动输入2个2位数号码组成一注，所输入的号码与开奖号码第九名、第十名相同，且顺序一致，即为中奖。', e: '投注方案： 05 08； 08；开奖号码后二位： 05 08，即中后二直选单式。'},
  {gn: '二星', ln: '后二', id: '4108:1', n: '组选复式', d: '从第九名、第十名中各选择一个号码组成一注，所选号码与开奖号码第九名、第十名相同，顺序不限，即为中奖。', e: '投注方案： 05 08； 08；开奖号码后二位： 05 08 或者 08 05，即中后二组选复式。'},
  {gn: '二星', ln: '后二', id: '4109:0', n: '组选单式', d: '手动输入2个2位数号码组成一注，所输入的号码与开奖号码第九名、第十名相同，顺序不限，即为中奖。', e: '投注方案： 05 08； 08；开奖号码后二位： 05 08 或者 08 05，即中后二组选单式。'},

  {gn: '二星', ln: '三四名', id: '4110:1', n: '直选复式', d: '从第三名、第四名中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案： 05 08；开奖号码三四名位： 05 08，即中三四名直选复式。'},
  {gn: '二星', ln: '三四名', id: '4111:0', n: '直选单式', d: '手动输入2个2位数号码组成一注，所输入的号码与开奖号码第三名、第四名相同，且顺序一致，即为中奖。', e: '投注方案： 05 08； 08；开奖号码三四名位： 05 08 ，即中三四名直选单式。'},
  {gn: '二星', ln: '三四名', id: '4112:1', n: '组选复式', d: '从第三名、第四名中各选择一个号码组成一注，所选号码与开奖号码第三名、第四名相同，顺序不限，即为中奖。', e: '投注方案： 05 08； 08；开奖号码三四名位： 05 08 或者 08 05，即中三四名组选复式。'},
  {gn: '二星', ln: '三四名', id: '4113:0', n: '组选单式', d: '手动输入2个2位数号码组成一注，所输入的号码与开奖号码第三名、第四名相同，顺序不限，即为中奖。', e: '投注方案： 05 08； 08；开奖号码三四名位： 05 08 或者 08 05，即中三四名组选单式。'},

  // 三星
  {gn: '三星', ln: '前三', id: '4114:1', n: '直选复式', d: '从冠军、亚军、第三名中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案：05 06 08；开奖号码前三位： 05 06 08，即中前三直选复式。'},
  {gn: '三星', ln: '前三', id: '4115:0', n: '直选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码冠军、亚军、第三名相同，且顺序一致，即为中奖。', e: '投注方案：05 06 08； 08；开奖号码前三位： 05 06 08，即中前三直选单式。'},
  {gn: '三星', ln: '前三', id: '4116:1', n: '组选复式', d: '从冠军、亚军、第三名中各选择一个号码组成一注，所选号码与开奖号码冠军、亚军、第三名相同，顺序不限，即为中奖。', e: '投注方案：05 06 08； 08；开奖号码前三位： 05 06 08 或者 08 06 05，即中前三组选复式。'},
  {gn: '三星', ln: '前三', id: '4117:0', n: '组选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码冠军、亚军、第三名相同，顺序不限，即为中奖。', e: '投注方案：05 06 08； 08；开奖号码前三位： 05 06 08 或者 08 06 05，即中前三组选单式。'},

  {gn: '三星', ln: '后三', id: '4118:1', n: '直选复式', d: '从第八名、第九名、第十名中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案： 05 06 08；开奖号码后三位： 05 06 08，即中后三直选复式。'},
  {gn: '三星', ln: '后三', id: '4119:0', n: '直选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码第八名、第九名、第十名相同，且顺序一致，即为中奖。', e: '投注方案： 05 06 08； 08；开奖号码后三位： 05 06 08，即中后三直选单式。'},
  {gn: '三星', ln: '后三', id: '4120:1', n: '组选复式', d: '从第八名、第九名、第十名中各选择一个号码组成一注，所选号码与开奖号码第八名、第九名、第十名相同，顺序不限，即为中奖。', e: '投注方案： 05 06 08； 08；开奖号码后三位： 05 06 08 或者 08 06 05，即中后三组选复式。'},
  {gn: '三星', ln: '后三', id: '4121:0', n: '组选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码第八名、第九名、第十名相同，顺序不限，即为中奖。', e: '投注方案： 05 06 08； 08；开奖号码后三位： 05 06 08 或者 08 06 05，即中后三组选单式。'},

  // 四星
  {gn: '四星', ln: '前四', id: '4122:1', n: '直选复式', d: '从冠军、亚军、第三名、第四名中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案：03 05 06 08； 开奖号码前四位： 03 05 06 08，即中前四直选复式。'},
  {gn: '四星', ln: '前四', id: '4123:0', n: '直选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码冠军、亚军、第三名、第四名相同，且顺序一致，即为中奖。', e: '投注方案：03 05 06 08； 开奖号码前四位： 03 05 06 08，即中前四直选单式。'},
  {gn: '四星', ln: '前四', id: '4124:1', n: '组选复式', d: '从冠军、亚军、第三名、第四名中各选择一个号码组成一注，所选号码与开奖号码冠军、亚军、第三名、第四名相同，顺序不限，即为中奖。', e: '投注方案：03 05 06 08； 开奖号码前四位： 03 05 06 08 或者 08 06 05 03，即中前四组选复式。'},
  {gn: '四星', ln: '前四', id: '4125:0', n: '组选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码冠军、亚军、第三名、第四名相同，顺序不限，即为中奖。', e: '投注方案：03 05 06 08； 开奖号码前四位： 03 05 06 08 或者 08 06 05 03，即中前四组选单式。'},

  {gn: '四星', ln: '后四', id: '4126:1', n: '直选复式', d: '从第七名、第八名、第九名、第十名中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案： 03 05 06 08；开奖号码后四位： 03 05 06 08，即中后四直选复式。'},
  {gn: '四星', ln: '后四', id: '4127:0', n: '直选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码第七名、第八名、第九名、第十名相同，且顺序一致，即为中奖。', e: '投注方案： 03 05 06 08； 开奖号码后四位： 03 05 06 08，即中后四直选单式。'},
  {gn: '四星', ln: '后四', id: '4128:1', n: '组选复式', d: '从第七名、第八名、第九名、第十名中各选择一个号码组成一注，所选号码与开奖号码第七名、第八名、第九名、第十名相同，顺序不限，即为中奖。', e: '投注方案： 03 05 06 08； 开奖号码后四位： 03 05 06 08 或者 08 06 05 03，即中后四组选复式。'},
  {gn: '四星', ln: '后四', id: '4129:0', n: '组选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码第七名、第八名、第九名、第十名相同，顺序不限，即为中奖。', e: '投注方案： 03 05 06 08； 开奖号码后四位： 03 05 06 08 或者 08 06 05 03，即中后四组选单式。'},

  // 五星
  {gn: '五星', ln: '前五', id: '4130:1', n: '直选复式', d: '从冠军、亚军、第三名、第四名、第五名中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案：03 05 06 08 09；开奖号码前五位： 03 05 06 08 09，即中前五直选复式。'},
  {gn: '五星', ln: '前五', id: '4131:0', n: '直选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码冠军、亚军、第三名、第四名、第五名相同，且顺序一致，即为中奖。', e: '投注方案：03 05 06 08 09； 09；开奖号码前五位： 03 05 06 08 09，即中前五直选单式。'},
  {gn: '五星', ln: '前五', id: '4132:1', n: '组选复式', d: '从冠军、亚军、第三名、第四名、第五名中各选择一个号码组成一注，所选号码与开奖号码冠军、亚军、第三名、第四名、第五名相同，顺序不限，即为中奖。', e: '投注方案： 03 05 06 08 09； 09；开奖号码前五位： 05 06 08 09 或者 09 08 06 05 03，即中前五组选复式。'},
  {gn: '五星', ln: '前五', id: '4133:0', n: '组选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码冠军、亚军、第三名、第四名、第五名相同，顺序不限，即为中奖。', e: '投注方案：03 05 06 08 09； 09；开奖号码前五位： 03 05 06 08 09 或者 09 08 06 05 03，即中前五组选单式。'},

  {gn: '五星', ln: '后五', id: '4134:1', n: '直选复式', d: '从第六名、第七名、第八名、第九名、第十名中各选择一个号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。 ', e: '投注方案：03 05 06 08 09；开奖号码后五位： 03 05 06 08 09，即中后五直选复式。'},
  {gn: '五星', ln: '后五', id: '4135:0', n: '直选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码第六名、第七名、第八名、第九名、第十名相同，且顺序一致，即为中奖。', e: '投注方案：03 05 06 08 09； 09；开奖号码后五位： 03 05 06 08 09，即中后五直选单式。'},
  {gn: '五星', ln: '后五', id: '4136:1', n: '组选复式', d: '从第六名、第七名、第八名、第九名、第十名中各选择一个号码组成一注，所选号码与开奖号码第六名、第七名、第八名、第九名、第十名相同，顺序不限，即为中奖。', e: '投注方案： 03 05 06 08 09； 09；开奖号码后五位： 05 06 08 09 或者 09 08 06 05 03，即中后五组选复式。'},
  {gn: '五星', ln: '后五', id: '4137:0', n: '组选单式', d: '手动输入3个2位数号码组成一注，所输入的号码与开奖号码第六名、第七名、第八名、第九名、第十名相同，顺序不限，即为中奖。', e: '投注方案：03 05 06 08 09； 09；开奖号码后五位： 03 05 06 08 09 或者 09 08 06 05 03，即中后五组选单式。'},

  {gn: '不定位', id: '4140:0', n: '前三不定位', d: '从01-10中共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前3个号码相同，即为中奖', e: '投注方案：03 05 06；开奖号码前三位： 03 05 06，即中前三不定位。'},
  {gn: '不定位', id: '4141:0', n: '后三不定位', d: '从01-10中共10个号码中选择3个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后3个号码相同，即为中奖', e: '投注方案：03 05 06；开奖号码后三位： 03 05 06，即中后三不定位。'},
  {gn: '不定位', id: '4142:0', n: '前四不定位', d: '从01-10中共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前4个号码相同，即为中奖', e: '投注方案：03 05 06 08；开奖号码前四位： 03 05 06 08，即中前四不定位。'},
  {gn: '不定位', id: '4143:0', n: '后四不定位', d: '从01-10中共10个号码中选择4个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后4个号码相同，即为中奖', e: '投注方案：03 05 06 08；开奖号码后四位： 03 05 06 08，即中后四不定位。'},
  {gn: '不定位', id: '4144:0', n: '前五不定位', d: '从01-10中共10个号码中选择5个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的前5个号码相同，即为中奖', e: '投注方案：03 05 06 08 09；开奖号码前五位： 03 05 06 08 09，即中前五不定位。'},
  {gn: '不定位', id: '4145:0', n: '后五不定位', d: '从01-10中共10个号码中选择5个不重复的号码组成一注，所选号码与当期顺序摇出的10个号码中的后5个号码相同，即为中奖', e: '投注方案：03 05 06 08 09；开奖号码后五位： 03 05 06 08 09，即中后五不定位。'},

  {gn: '冠亚和值', id: '4138:1', n: '和值', d: '所选数值等于开奖号码的冠军、亚军两个数字相加之和，即为中奖。', e: '投注方案： 3；开奖号码前两位：01 02或者02 01,即中冠亚和值。'},
  {gn: '冠亚和值', id: '4139:1', n: '和值大小单双', d: '所选数值与开奖号码的冠军、亚军两个数字相加之和的形态(大、小、单、双)相同，即为中奖，注：>11为大，<=11为小', e: '投注方案： 小；开奖号码前两位：01 02,即中冠亚和值。'},
  {gn: '龙虎', id: '4146:1', n: '龙虎', d: '根据选择的位置比较第一位与第二位号码的大小，大则为：龙，小则为：虎；', e: '选择位置: 一VS十；投注方案：龙； 开奖号码：02 * * * * * * * * * 01，即中龙虎。'},
  {gn: '大小单双', id: '4147:1', n: '大小单双', d: '任选一个位置的一个号码组成一注，所选号码与开奖号码对应位置的形态(大、小、单、双)相同，即为中奖，注：>=11为大，小于11为小', e: '投注方案： 冠军-小；开奖号码前一位：01,即中冠亚和值大小单双。'},
  {gn: '定位胆', id: '4101:1', n: '定位胆', d: '从第一名到第十名、01-10共10个号码中，选择其中一名次中的任意1个号码当作一注，所选名次的号码与当期顺序摇出的10个号码中对应名次的号码一致，即为中奖', e: '投注方案：第一名01，开奖号码： 01 * * * * * * * * *，即中定位胆'},
  
]